app/controllers/store_controller.rb

SELECT * FROM "products" WHERE ("products"."id" = 2)
---
  def add_to_cart
      @cart = find_cart
      product = Product.find(params[:id])